<h1 style="color:blue">Pivot basics</h1>

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("weather.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [2]:
df.pivot(index='city',columns='date')

         temperature                   humidity
date        5/1/2017 5/2/2017 5/3/2017 5/1/2017 5/2/2017 5/3/2017
city
beijing           80       77       79       26       30       35
mumbai            75       78       82       80       83       85
new york          65       66       68       56       58       60

In [3]:
df.T

,0,1,2,3,4,5,6,7,8
date,5/1/2017,5/2/2017,5/3/2017,5/1/2017,5/2/2017,5/3/2017,5/1/2017,5/2/2017,5/3/2017
city,new york,new york,new york,mumbai,mumbai,mumbai,beijing,beijing,beijing
temperature,65,66,68,75,78,82,80,77,79
humidity,56,58,60,80,83,85,26,30,35

In [4]:
df.pivot(index='city',columns='date')["temperature"]

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         80        77        79
mumbai          75        78        82
new york        65        66        68

In [4]:
df.pivot(index='city',columns='date')["temperature"].to_csv("pivot.csv")

In [5]:
df.pivot(index='city',columns='date',values="humidity") # return a dataframe

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [6]:
df.pivot(index='date',columns='city')

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2017          80     75       65       26     80       56
5/2/2017          77     78       66       30     83       58
5/3/2017          79     82       68       35     85       60

In [7]:
df.pivot(index='date',columns='city').to_csv("pivotCity.csv")

In [8]:
df.pivot(index='humidity',columns='city')

              date                     temperature
city       beijing    mumbai  new york     beijing mumbai new york
humidity
26        5/1/2017       NaN       NaN        80.0    NaN      NaN
30        5/2/2017       NaN       NaN        77.0    NaN      NaN
35        5/3/2017       NaN       NaN        79.0    NaN      NaN
56             NaN       NaN  5/1/2017         NaN    NaN     65.0
58             NaN       NaN  5/2/2017         NaN    NaN     66.0
60             NaN       NaN  5/3/2017         NaN    NaN     68.0
80             NaN  5/1/2017       NaN         NaN   75.0      NaN
83             NaN  5/2/2017       NaN         NaN   78.0      NaN
85             NaN  5/3/2017       NaN         NaN   82.0      NaN

## <h1 style="color:blue">Pivot Table</h1>

In [5]:
df = pd.read_csv("weather2.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [6]:
df.pivot_table(index="city",columns="date")

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

<h2 style="color:brown">Margins</h2>

In [11]:
df.pivot_table(index="city",columns="date",aggfunc=np.sum)

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai        163      111         153      162
new york      110      122         126      142

In [10]:
df.pivot_table(index="city",columns="date", margins=True,aggfunc=np.sum)

         humidity               temperature
date     5/1/2017 5/2/2017  All    5/1/2017 5/2/2017  All
city
mumbai        163      111  274         153      162  315
new york      110      122  232         126      142  268
All           273      233  506         279      304  583

In [12]:
df.pivot_table(index="city",columns="date",aggfunc=np.sum)

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai        163      111         153      162
new york      110      122         126      142

In [8]:
df.pivot_table(index="city",columns="date",aggfunc=np.sum)["humidity"]

date      5/1/2017  5/2/2017
city
mumbai         163       111
new york       110       122

<h2 style="color:brown">Grouper</h2>

In [7]:
df = pd.read_csv("weather3.csv")
df

        date      city  temperature  humidity
0   5/1/2017  new york           65        56
1   5/2/2017  new york           61        54
2   5/3/2017  new york           70        60
3  12/1/2017  new york           30        50
4  12/2/2017  new york           28        52
5  12/3/2017  new york           25        51

In [8]:
print(type(df["date"][0]))
df['date'] = pd.to_datetime(df['date'])

<class 'str'>

In [9]:
df

        date      city  temperature  humidity
0 2017-05-01  new york           65        56
1 2017-05-02  new york           61        54
2 2017-05-03  new york           70        60
3 2017-12-01  new york           30        50
4 2017-12-02  new york           28        52
5 2017-12-03  new york           25        51

In [11]:
type(df["date"][0])

pandas._libs.tslibs.timestamps.Timestamp

In [10]:
df.pivot_table(index=pd.Grouper(freq='W',key='date'),columns='city')

             humidity temperature
city         new york    new york
date
2017-05-07  56.666667   65.333333
2017-12-03  51.000000   27.666667

In [17]:
df.pivot_table(index=pd.Grouper(freq='M',key='date'),columns='city')

             humidity temperature
city         new york    new york
date
2017-05-31  56.666667   65.333333
2017-12-31  51.000000   27.666667

In [17]:

df.pivot_table(index=pd.Grouper(freq='Y',key='date'),columns='city')

             humidity temperature
city         new york    new york
date
2017-12-31  53.833333        46.5

In [18]:
df.pivot_table(index=pd.Grouper(freq='Y',key='date'),columns='city', aggfunc=np.sum)

           humidity temperature
city       new york    new york
date
2017-12-31      323         279

In [ ]:
df.pivot_table(index=pd.Grouper(freq='Y',key='date'),columns='city', aggfunc=np.sum)